driver-tests/jmsbc/OndemandRead/JMSOndemandCA/test/TestCase4/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:trig="http://j2ee.netbeans.org/wsdl/JMSOndemand/triggerReadC">
  <soapenv:Body>
    <trig:triggerReadCOperation>
      <part1>?string?</part1>
    </trig:triggerReadCOperation>
  </soapenv:Body>
</soapenv:Envelope>